tdd_samples/games/app/controllers/games_controller.rb

  def index
    if params[:kind] == 'five_star'
      @games = Game.with_average_rating(5).all
---
SELECT * FROM "games"

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("name", "created_at", "max_players", "updated_at", "average_hours", "min_players") VALUES('Cash and Guns', '2010-04-21 02:06:18', NULL, '2010-04-21 02:06:18', NULL, NULL)

  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)
UPDATE "games" SET "updated_at" = '2010-04-21 02:06:29', "average_hours" = 0.75, "max_players" = 6, "min_players" = 3 WHERE "id" = 1